SMEO ACC/integrator/kostya-test-acc/templates/updateOpportunity

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext"
  xmlns:opp="urn:crmondemand/ws/ecbs/opportunity/"
  xmlns:data="urn:/crmondemand/xml/Opportunity/Data">
  <soapenv:Header>
      <@printSoapSecurityHeader/>
   </soapenv:Header>
  <soapenv:Body>
    <opp:OpportunityUpdate_Input>
      <data:ListOfOpportunity lastpage="1" recordcount="1">
        <data:Opportunity operation="OpportunityUpdate">
          <data:Id>testId</data:Id>
          <data:SalesStage>${body.variables.SalesStage}</data:SalesStage>
        </data:Opportunity>
      </data:ListOfOpportunity>
    </opp:OpportunityUpdate_Input>
  </soapenv:Body>
</soapenv:Envelope>